Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ8110CA80100.atdf
        <register name="HCMR0" offset="0x488" rw="RW" size="4" initval="0x00000000" caption="HBI Channel Mask 0 Register">
          <bitfield name="CHM" caption="Bitwise channel mask bit: 0 = masked, 1 = unmasked" mask="0xFFFFFFFF"/>
        </register>
        <register name="HCMR1" offset="0x48C" rw="RW" size="4" initval="0x00000000" caption="HBI Channel Mask 1 Register">
          <bitfield name="CHM" caption="Bitwise channel mask bit: 0 = masked, 1 = unmasked" mask="0xFFFFFFFF"/>
        </register>
        <register name="HCER0" offset="0x490" rw="RW" size="4" initval="0x00000000" caption="HBI Channel Error 0 Register">
          <bitfield name="CERR" caption="Bitwise channel error bit" mask="0xFFFFFFFF"/>
        </register>
        <register name="HCER1" offset="0x494" rw="RW" size="4" initval="0x00000000" caption="HBI Channel Error 1 Register">
          <bitfield name="CERR" caption="Bitwise channel error bit" mask="0xFFFFFFFF"/>
        </register>
        <register name="HCBR0" offset="0x498" rw="R" size="4" initval="0x00000000" caption="HBI Channel Busy 0 Register">
          <bitfield name="CHB" caption="Bitwise channel busy bit: 0 = idle, 1 = busy" mask="0xFFFFFFFF"/>
        </register>
        <register name="HCBR1" offset="0x49C" rw="R" size="4" initval="0x00000000" caption="HBI Channel Busy 1 Register">
          <bitfield name="CHB" caption="Bitwise channel busy bit: 0 = idle, 1 = busy" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDAT0" offset="0x4C0" rw="RW" size="4" initval="0x00000000" caption="MIF Data 0 Register">
          <bitfield name="DATA" caption="CTR data - bits[31:0] of 128-bit entry or DBR data - bits[7:0] of 8-bit entry" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDAT1" offset="0x4C4" rw="RW" size="4" initval="0x00000000" caption="MIF Data 1 Register">
          <bitfield name="DATA" caption="CTR data - bits[63:32] of 128-bit entry" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDAT2" offset="0x4C8" rw="RW" size="4" initval="0x00000000" caption="MIF Data 2 Register">
          <bitfield name="DATA" caption="CTR data - bits[95:64] of 128-bit entry" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDAT3" offset="0x4CC" rw="RW" size="4" initval="0x00000000" caption="MIF Data 3 Register">
          <bitfield name="DATA" caption="CTR data - bits[127:96] of 128-bit entry" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDWE0" offset="0x4D0" rw="RW" size="4" initval="0x00000000" caption="MIF Data Write Enable 0 Register">
          <bitfield name="MASK" caption="Bitwise write enable for CTR data - bits[31:0] (0 = disabled, 1 = enabled)" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDWE1" offset="0x4D4" rw="RW" size="4" initval="0x00000000" caption="MIF Data Write Enable 1 Register">
          <bitfield name="MASK" caption="Bitwise write enable for CTR data - bits[63:32] (0 = disabled, 1 = enabled)" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDWE2" offset="0x4D8" rw="RW" size="4" initval="0x00000000" caption="MIF Data Write Enable 2 Register">
          <bitfield name="MASK" caption="Bitwise write enable for CTR data - bits[95:64] (0 = disabled, 1 = enabled)" mask="0xFFFFFFFF"/>
        </register>
        <register name="MDWE3" offset="0x4DC" rw="RW" size="4" initval="0x00000000" caption="MIF Data Write Enable 3 Register">
          <bitfield name="MASK" caption="Bitwise write enable for CTR data - bits[127:96] (0 = disabled, 1 = enabled)" mask="0xFFFFFFFF"/>
        </register>
        <register name="MCTL" offset="0x4E0" rw="RW" size="4" initval="0x00000000" caption="MIF Control Register">
          <bitfield name="XCMP" caption="Transfer complete (write 0 to clear)" mask="0x1"/>
        </register>
        <register name="MADR" offset="0x4E4" rw="RW" size="4" initval="0x00000000" caption="MIF Address Register">
          <bitfield name="ADDR" caption="DBR address of 8-bit entry - bits[13:8].CTR address of 128-bit entry or DBR address of 8-bit entry - bits[7:0]" mask="0x3FFF"/>
          <bitfield name="TB" caption="Target location bit (0 = selects CTR, 1 = selects DBR)" mask="0x40000000"/>
          <bitfield name="WNR" caption="Write-Not-Read selection (0 = read, 1 = write)" mask="0x80000000"/>
        </register>
        <register name="ACTL" offset="0x7C0" rw="RW" size="4" initval="0x00000000" caption="AHB Control Register">
          <bitfield name="SCE" caption="Software clear enable: 0 = Hardware clears interrupt after a ACSRn register read 1 = Software clears interrupt" mask="0x1"/>
          <bitfield name="SMX" caption="AHB interrupt mux enable: 0 = ACSR0 generates an interrupt on ahb_int[0]; ACSR1 generates an interrupt on ahb_int[1] 1 = ACSR0 and ACSR1 generate an interrupts on ahb_int[0] only" mask="0x2"/>
          <bitfield name="DMAMODE" caption="DMA Mode: 0 = DMA Mode 0 1 = DMA Mode 1" mask="0x4"/>
          <bitfield name="MPB" caption="Packet buffering mode: 0 = single-packet mode 1 = multiple-packet mode" mask="0x10"/>
        </register>
        <register name="ACSR0" offset="0x7D0" rw="RW" size="4" atomic-op="clear:ACSR0" initval="0x00000000" caption="AHB Channel Status 0 Register">
          <bitfield name="CHS" caption="Interrupt status for logical channels 31 to 0: 0 = None 1 = Interrupt" mask="0xFFFFFFFF"/>
        </register>
        <register name="ACSR1" offset="0x7D4" rw="RW" size="4" atomic-op="clear:ACSR1" initval="0x00000000" caption="AHB Channel Status 1 Register">
          <bitfield name="CHS" caption="Interrupt status for logical channels 63 to 32: 0 = None 1 = Interrupt" mask="0xFFFFFFFF"/>
        </register>
        <register name="ACMR0" offset="0x7D8" rw="RW" size="4" initval="0x00000000" caption="AHB Channel Mask 0 Register">
          <bitfield name="CHM" caption="Bitwise channel mask bit:0 = Masked 1 = Unmasked" mask="0xFFFFFFFF"/>
        </register>
        <register name="ACMR1" offset="0x7DC" rw="RW" size="4" initval="0x00000000" caption="AHB Channel Mask 1 Register">
          <bitfield name="CHM" caption="Bitwise channel mask bit:0 = Masked 1 = Unmasked" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
